Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པ་ཐོབ་པ་དང་། བཏང་སྙོམས་ཆེན་པོ་ལ་གནས་པ་འཐོབ་པ་དང་། བདེ་བའི་རྣམ་པར་རྟོག་པ་འཐོབ་པ་དང་། རབ་ཏུ་དབེན་པའི་ཆོས་རྣམས་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Young man, that which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas attain the state of great compassion, attain the state of great equanimity, and attain easeful examination and analysis of phenomena.

source: །གཞན་ཡང་གཞོན་ནུ་ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲོག་གཅོད་པ་སྤོང་བར་འགྱུར་བ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། མི་ཚངས་པར་སྤྱོད་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མའི་ཚིག་དང་། ཚིག་རྩུབ་པོ་དང་། ཁྱལ་པར་སྨྲ་བ་དང་། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་དང་། སྲང་ལ་གཡོ་བྱེད་པ་དང་། ཚད་ལ་གཡོ་བྱེད་པ་དང་། ནོར་ལ་གཡོ་བྱེད་པ་དང་། གཟུང་བ་དང་། བཅིང་བ་དང་། གཙེ་བ་དང་། བརྡེག་པ་དང་། བསྡིགས་པ་དང་། གཅད་པ་དང་། དབུག་པ་དང་། ཞེ་ལ་གནོན་པ་དང་། ཆགས་པ་དང་། སེར་སྣ་མ་སྤངས་པར་འགྱུར་བ་དང་། ལག་པ་རྒོད་པ་དང་། རྐང་པ་རྒོད་པ་དང་། རྐང་ལག་མ་བསྡམས་པ་དང་། དེའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་གནས་ངན་ལེན་སྤངས་ཤིང་ཏ་ལའི་མགོ་བཅད་པ་བཞིན་དུ་མ་འོངས་པའི་དུས་ན་མི་སྐྱེ་བའི་ཆོས་ཅན་དུ་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་དེའི་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Moreover, young man, that which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas desist from killing, taking what is not given, not maintaining celibacy, lying, slandering, harsh speech, idle talk, avarice, malice, and wrong views; desist from fraud in weights, fraud in measures, and fraud in wealth; desist from capturing, binding, restraining, beating, threatening, severing, impaling, and terrorizing; desist from desire and greed; desist from wild hand movements, wild leg movements, and unrestrained movements of the legs and arms; and desist from wicked habits of body, speech, or mind so that, like palm trees that have had their tops cut off, they will not arise again in the future.

source: །གཞོན་ནུ་དེ་ལྟ་བས་ན་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ།
en: “Therefore, young man, understand this teaching in the following way.

source: གཞོན་ནུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ། ཡངས་པ། ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་དེའི་ཚེ་དེའི་དུས་ན་ཡེ་ཤེས་སྣང་བ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ།
en: Young man, in the past, innumerable, vast, immeasurable, inconceivable, unfathomable countless eons ago, at that time and in those days, there appeared in the world the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Jñānaprabhāsa, who was perfect in wisdom and conduct, a sugata, a knower of the world, an unsurpassable guide who tamed beings, a teacher of devas and humans, a buddha, and a bhagavān.

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ། གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་ཡེ་ཤེས་སྣང་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་དྲུག་ཅུར་གྱུར་ཏོ།
en: “At that time and in those days, the lifespan of the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Jñānaprabhāsa was six hundred million years.

source: །དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་དྲུག་ཅུའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་བྱུང་ངོ་།
en: He had a śrāvaka saṅgha of six hundred million arhats.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཡང་དཔག་ཏུ་མེད་པ་བྱུང་ངོ་།
en: There were countless bodhisattva mahāsattvas who held the supreme Dharma.

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཁྱད་པར་སེམས་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “Young man, at that time and in those days, there was a king named Viveśacintin.

source: རྒྱལ་པོ་ཁྱད་པར་སེམས་དེ་སྲོག་ཆགས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་འོངས་སོ།
en: King Viveśacintin came with eight hundred million people into the presence of the Tathāgata.

source: །འོངས་ནས་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: When he arrived he bowed his head down to the feet of the Tathāgata, circumambulated the Bhagavān three times, and sat down in one place.

source: །རྒྱལ་པོ་ཁྱད་པར་སེམས་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་དེ་བཞིན་གཤེགས་པ་ལ་བསྙེན་བཀུར་བྱེད་དོ།
en: Once King Viveśacintin had sat down in one place, he honored the Tathāgata.

source: །དེ་ནས་ཡེ་ཤེས་སྣང་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་རྒྱལ་པོ་ཁྱད་པར་སེམས་འཁོར་དང་བཅས་པའི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ལུས་ཀྱི་སྡོམ་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒོར་འཇུག་པའི་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: “Then the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Jñānaprabhāsa, knowing the superior aspiration of King Viveśacintin and his followers, taught them from this Dharma teaching by chanting the following verses on entering through the doorway of the samādhi of physical restraint:

source: །ཇི་ལྟར་བར་སྣང་ནམ་མཁའ་རྣམ་དག་སྟེ།
en: “ ‘Just as space and the sky are pure,

source: །ཤིན་ཏུ་དག་ཅིང་རང་བཞིན་འོད་གསལ་བ།
en: Ultimately pure, and with a clear nature,

source: །དེ་བཞིན་ལུས་ཀྱི་སྡོམ་པ་དག་པ་ཡང་།
en: The restraint of the body, too, is pure,

source: །དབྱངས་ཀྱིས་བསྟན་པར་ནམ་ཡང་ནུས་མི་འགྱུར།
en: And cannot be taught in verse. {1}

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་ནི་དབེན་ཞིང་སྟོང་།
en: “ ‘This physical restraint is devoid and empty,

source: །འདི་འདྲ་གཉིས་པོ་ལུས་ཀྱི་མཚན་ཉིད་དེ།
en: And those are also the two characteristics of the body.

source: །དེ་དག་མཚན་ཉིད་མེད་པ་བར་སྣང་བཞིན།
en: Just like space it is without characteristics.

source: །ལུས་ཀྱི་སྡོམ་པ་དེ་ཡི་མཚན་ཉིད་བཤད།
en: That is taught to be the characteristic of the body’s restraint. {2}

source: །སྡོམ་པའི་མཚན་ཉིད་དེ་འདྲར་སུས་ཤེས་པ།
en: “ ‘Those who know that characteristic of the body’s restraint

source: །དེ་ལ་སྡོམ་པ་ནམ་ཡང་མེད་མི་འགྱུར།
en: Will never be ones without restraint.

source: །མི་འཇུག་དེ་ཡི་སྤྱོད་ཡུལ་ག་ལ་ཡིན། །ཟག་པ་མེད་པ་ལ་ནི་སྐྱེ་བ་མེད།
en: How can those without activity have a field of conduct? Those who are immaculate have no birth. {3} “ ‘One cannot have this restraint while pursuing desires

source: །གཟུགས་དང་ལོངས་སྤྱོད་ལ་ནི་སྲིད་བསྐྱེད་ནས། །འདོད་པ་དག་ལ་སྟེན་པས་མི་ནུས་ཏེ།
en: Through yearning for forms and enjoyments.

source: །སྲིད་པ་དག་གི་ཉེས་པ་མི་ཤེས་པས།
en: Not knowing the wickedness of existence,

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་ནི་ཤེས་མི་ནུས། །ཟག་མེད་སྡོམ་པ་གང་གིས་རབ་ཤེས་པ།
en: One cannot know this restraint of the body. {4}

source: །དེ་ལ་སྐྱེ་བ་ནམ་ཡང་ཡོད་མི་འགྱུར།
en: “ ‘There will never be birth For those who have immaculate restraint.

source: །དགྲ་བཅོམ་པ་ཡི་ཆོས་ནི་དེ་འདྲ་སྟེ།
en: They have qualities like those of the arhats,

source: །མུ་སྟེགས་ཅན་གྱིས་ཤེས་པར་སླ་མ་ཡིན།
en: Which cannot easily be known by tīrthikas. {5}

source: །གང་དག་ཁམས་གསུམ་ཀུན་ལ་ཡིད་སྐྲག་ཅིང་།
en: “ ‘Those who are terrified of the three realms

source: །འདོད་པའི་ལོངས་སྤྱོད་ལ་ཡང་འདོད་མི་སྐྱེད།
en: Will not develop desire for sensual gratification.

source: །རྒྱལ་པོའི་སྲིད་དང་ལོངས་སྤྱོད་ཡོང་མི་འདོད།
en: They who do not wish for the pleasures of a king

source: །དེ་དག་ལུས་ཀྱི་སྡོམ་པ་འདི་འདྲ་ཤེས།
en: Will know this kind of restraint of the body. {6}

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་ནི་དོན་ཅེས་བྱ།
en: “ ‘The restraint of the body is said to have this meaning.

source: །དོན་ནི་སྒྲ་ཡིས་བསྟན་པར་མི་ནུས་ཏེ།
en: It is a meaning that cannot be taught through words.

source: །འདི་འདྲའི་ཆོས་ཀྱི་ཚུལ་ནི་གང་ཤེས་པ།
en: The one who knows this way of the Dharma

source: །དེ་ནི་སྡོམ་པ་འདི་ལ་གནས་པ་ཡིན།
en: Is firmly established in this restraint. {7}

source: །དོན་ལ་ཞུགས་ལ་ངས་ནི་དོན་བསྟན་ཏེ།
en: “ ‘I teach the meaning to those who are engaged with the meaning,

source: །མཁས་པ་སུ་དག་དོན་གྱི་ཚུལ་ལ་མོས།
en: To those wise ones intent upon the way of the meaning.

source: །དོན་མེད་རྣམ་སྤངས་དོན་ལ་གནས་པ་རྣམས།
en: Those engaged in the meaning shun that which is not the meaning

source: །དེ་དག་སྡོམ་ལ་རྟག་ཏུ་གནས་པ་ཡིན།
en: And are always firmly established in that restraint. {8}

source: །རྒྱལ་བའི་བསྟན་ལ་དོན་དུ་གང་བརྗོད་དང་། །ཇི་ལྟ་བུར་ནི་དོན་ཡིན་རྣམ་རིག་སྟེ།
en: “ ‘How can one know the meaning That is spoken of in the teaching of the jinas?

source: །དོན་ཚུལ་རང་བཞིན་གང་གིས་ཤེས་པ་ནི།
en: Those who know the nature of that way of meaning

source: །ལུས་ཀྱི་སྡོམ་པ་ལ་ཡང་གནས་ཞེས་བྱ།
en: Are said to be established in the restraint of the body. {9}

source: །གང་གིས་བདག་མེད་གསོག་དང་སྟོང་ཉིད་དང་། །མཚན་མ་མེད་པར་རྣམ་པར་རིག་གྱུར་པ།
en: “ ‘Those who know insubstantiality, emptiness, The absence of a self, and the absence of attributes

source: །དེ་ལ་ནམ་ཡང་སྡོམ་པ་མེད་མི་འགྱུར།
en: Will never be without that restraint,

source: །འདི་ལྟར་དེས་ནི་ཡང་དག་ངེས་ལ་བསླབས།
en: And in that way they will train in correct certainty. {10}

source: །དངོས་པོ་དག་ནི་དངོས་མེད་གང་རིག་པ།
en: “ ‘They know that existents are nonexistent

source: །དེ་ནི་དངོས་པོ་དག་ལ་ཡོང་མི་ཆགས།
en: And do not give rise to attachment to existents.

source: །དངོས་པོ་ཀུན་ལ་ནམ་ཡང་མི་ཆགས་པ།
en: They will never give rise to attachment to any existent

source: །དེ་ནི་མཚན་མེད་ཏིང་འཛིན་རེག་པར་འགྱུར།
en: And will reach the samādhi of the absence of attributes. {11}

source: །ངོ་བོ་ཉིད་སྟོང་རང་བཞིན་འོད་གསལ་བ། །བདག་མེད་ཆོས་རྣམས་དེ་ཡིས་རྣམ་རིག་ན།
en: “ ‘Those who know that phenomena have no self, Have an empty nature and the characteristic of clarity,

source: །འདི་ལྟར་དེས་ནི་ཡང་དག་ངེས་པར་རྟོགས།
en: And thus will have definite correct understanding. {12}

source: །གང་གིས་ཕུང་པོ་ལྔ་རྣམས་སྟོང་པར་ཤེས།
en: “ ‘Those who know the five skandhas to be empty

source: །རང་བཞིན་སྟོང་ཞིང་བདག་མེད་རིག་ན་ནི།
en: Know their empty nature that is devoid of a self.

source: །ལུས་ཀྱིས་ལས་གང་ཡང་དག་སྤྱོད་བྱེད་པ། །དེ་ལ་ནམ་ཡང་སྡོམ་པ་མེད་མི་འགྱུར།
en: They will never be without that restraint In any physical activity that they perform. {13}

source: །མཚན་མ་དག་ལ་འཛིན་ཅིང་མ་བསྡམས་ཏེ།
en: “ ‘Those who focus on attributes, who are without restraint,

source: །ཁོར་མོར་བདག་ཏུ་འདུ་ཤེས་རབ་གནས་པ།
en: Who are constantly fixed in the conception of a self—

source: །གཟུགས་ལ་ཆགས་པར་གྱུར་པའི་སྐྱེ་བོ་དག །མ་བསྡམས་པ་ཡི་འདོད་ཆགས་རབ་ཏུ་ལྡང་།
en: Those beings who are attached to forms Are overcome by unrestrained desires. {14}

source: །གང་རྣམས་ཡང་དག་མཐའ་ལ་བསླབས་གྱུར་ཅིང་།
en: “ ‘Those who are trained in the true, highest point,

source: །སྟོང་པ་རྟོགས་པར་རིག་པ་དེས་པ་དག །སྡོམ་མེད་གང་གིས་ངན་འགྲོར་འགྲོ་བ་ཡིས། །འདོད་ཆགས་དེ་ལ་ནམ་ཡང་ལྡང་བ་མེད།
en: The gentle ones who have realized emptiness, Are never overcome by the arising of desires That cause the unrestrained to go to the lower realms. {15} “ ‘Just as all the ants together cannot shake

source: །ཇི་ལྟར་རི་རབ་དག་ནི་ཆེན་པོ་ལ། །གྲོག་མ་ཀུན་གྱིས་གཡོས་ཤིང་འགུལ་མི་ནུས། །དེ་བཞིན་མཁས་པ་ཡང་དག་ཚུལ་བསླབས་པས།
en: And cannot move great Mount Sumeru,

source: །ལྷ་ཡི་གཟུགས་ཀྱིས་ཀྱང་ནི་དེ་མི་གཡོས།
en: Even divine forms cannot unsettle A wise one who is correctly trained. {16}

source: །ནམ་མཁའ་ལ་ནི་རི་མོར་བྲི་ནུས་ཤིང་།
en: “ ‘Someone may be able to paint a picture on space,

source: །ལག་པས་ནམ་མཁའ་གཟུང་དུ་རུང་གྱུར་ཀྱང་།
en: Someone may be able to grasp space in his hand,

source: །འདོད་ཆགས་ཞེ་སྡང་བདུད་རྣམས་བྱེ་བ་ཡིས།
en: But desire, anger, or millions of māras

source: །དེ་ལ་རྣམ་པར་བསྐྱོད་པར་ཡོང་མི་ནུས།
en: Will not be able to unsettle such a wise one. {17}

source: །ལ་ལས་བྲག་ཅ་དག་ནི་གཟུང་ནུས་ཤིང་།
en: “ ‘Someone may be able to catch an echo,

source: །ཆུ་ཡི་སྟེང་ན་རྡོ་ཡང་འཕྱོ་གྱུར་ཀྱང་།
en: A stone may be able to float on the water, But no one can see the thoughts of someone

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་འདྲ་སུས་བསླབས་པ། །དེ་ཡི་བསམ་པ་དག་ཀྱང་བལྟར་མི་ནུས།
en: Who is trained in this restraint of the body. {18}

source: །འཇིག་རྟེན་ཀུན་ན་སྒྲ་མང་ཇི་སྙེད་པ།
en: “ ‘Someone may be able to catch all the sounds In the entire world and put them in a box,

source: །གཟུང་སྟེ་སྒྲོམ་དུ་གཞུག་པར་ནུས་གྱུར་ཀྱང་།
en: But they cannot know whether someone who maintains

source: །ལུས་ཀྱི་སྡོམ་པའི་གནས་དང་མི་གནས་པ།
en: The restraint of the body is or is not maintaining it. {19}

source: །སུས་ཀྱང་རྣམ་པར་རིག་པར་བྱེད་མི་ནུས། །སྤྲིན་ལས་སྒྲ་བསྒྲགས་གློག་རྣམས་རྒྱུ་བ་དང་། །ཉི་མའི་འཁོར་ལོས་འོད་ཟེར་གཟུང་ནུས་ཀྱང་།
en: “ ‘Someone may be able to catch the light from the disk of the sun, Or the thunder and lightning that burst from the clouds, But they cannot know the nature of the body

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་ལ་སུས་བསླབས་པ།
en: Of someone who has trained in the restraint of the body. {20}

source: །དེ་ཡི་རང་བཞིན་ཤེས་པར་ནུས་མི་འགྱུར།
en: “ ‘Someone may be able to catch in a trap or a net

source: །རླུང་གི་དཀྱིལ་འཁོར་ཕྱོགས་བཞིར་ལྡང་བ་ནི།
en: The circle of wind that moves through the four directions,

source: །རྒྱ་དང་སྙི་ཡིས་གཟུང་བར་ནུས་གྱུར་ཀྱང་།
en: But they cannot come to know the body

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་ལ་གང་གནས་པ། །དེ་ཡི་ལུས་ནི་ནམས་ཀྱང་ཤེས་མི་ནུས།
en: Of someone who is established in the restraint of the body. {21}

source: །སྲོག་ཆགས་ཀུན་གྱི་སྤྱོད་ཡུལ་དེ་མ་ཡིན།
en: “ ‘This is not the domain of activity of beings.

source: །སེམས་སྡོམ་གང་ལ་མཁས་པ་དེ་གནས་ཤིང་།
en: It is the domain of a wise one who has a controlled mind.

source: །སྤྱོད་ཡུལ་གང་གནས་ལུས་ཀྱི་སྡོམ་པ་ནི།
en: It is the domain of activity of someone with restraint of the body

source: །འཇིག་རྟེན་ཆོས་ཀྱིས་མི་གོས་ནམ་མཁའ་བཞིན།
en: Who, like space, is unstained by worldly qualities. {22} “ ‘Someone may be able to see the tracks of all the creatures

source: །ཕྱོགས་བཞིར་ནམ་མཁའ་ལ་ནི་རྒྱུ་བ་ཡིས།
en: That move through the sky in all four directions,

source: །སྲོག་ཆགས་ཀུན་རྗེས་སོ་སོར་བལྟ་ནུས་ཀྱང་།
en: But they would not be able to know the extent

source: །དེ་ཡི་ལུས་དང་སེམས་ཀྱི་སྤྱོད་ཡུལ་ལ། །ཚད་གཟུང་བར་ནི་སུ་ཡང་ནུས་པ་མེད།
en: Of the fields of activity of such a person’s mind or body. {23}

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་ལ་གང་གནས་པའི།
en: “ ‘Those who are established in this restraint of the body

source: །ཉོན་མོངས་རྣམ་མང་ཐམས་ཅད་མེད་པར་འགྱུར།
en: Do not have any of the various kinds of kleśas.

source: །དེ་ཡི་ཉོན་མོངས་ཉེ་བ་རབ་ཏུ་སྤངས།
en: They have eliminated even the minor kleśas,

source: །འདི་ལྟར་དེས་ནི་ལུས་ཀྱི་སྡོམ་པ་བསླབས།
en: And thus are trained in the restraint of the body. {24}

source: །དེ་ལ་མཚོན་ཆ་དང་ནི་མེས་མི་ཚུགས།
en: “ ‘They cannot be harmed by weapons or by fire,

source: །དེ་ལྟར་དེ་ཡི་ལུས་ནི་གཟུང་དུ་མེད།
en: And in that way their bodies are ungraspable.

source: །དེ་ནི་ཞི་བ་རབ་ཞི་ཏིང་འཛིན་གནས།
en: They remain in the peace, perfect peace, of samādhi,

source: །དེ་ལྟར་གནས་པ་འཇིགས་མེད་སྐྲག་པ་མེད།
en: “ ‘Thus established, they have no fear, they have no terror,

source: །དེ་ལ་འཁྲུག་སེམས་མི་སྐྱེ་ཕྲག་དོག་མེད།
en: Their minds are undisturbed, and they feel no envy.

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་འདྲ་སུས་བསླབས་པ།
en: They who are thus trained in the restraint of the body

source: །དེ་ནི་གཙེ་བ་ཀུན་ལས་ཐར་བ་ཡིན།
en: Have become liberated from all misfortune. {26}

source: དུག་དང་མཚོན་གྱིས་ནམ་ཡང་མི་འཇིགས་ཤིང་།
en: “ ‘They are not afraid of poison or weapons;

source: །མེ་དང་ཆུ་ཡི་ནང་ནའང་འཇིགས་པ་མེད།
en: They are not afraid in the middle of fire or water.

source: །ཆོམ་རྐུན་གཡོན་ཅན་སྡིག་པ་བྱེད་པ་དང་། །སྦྲུལ་གདུག་ནང་དུ་སོང་ཡང་འཇིགས་མེད་དེ།
en: Swindlers, criminals, and poisonous snakes.

source: །འདི་ལྟར་དེ་ནི་བདག་ཏུ་འདུ་ཤེས་མེད།
en: In this way they have no conception of a self

source: །འདུ་ཤེས་རྣམ་པར་གྲོལ་ལ་འཇིགས་མི་འབྱུང་།
en: And, liberated from that concept, they have no fear. {28}

source: །འཇིགས་ལས་རྣམ་པར་གྲོལ་བ་སྐྲག་མི་སྐྱེ།
en: “ ‘Those who are freed from fear do not become frightened.

source: །སྐྲག་པ་མེད་ལ་གཡོ་བ་མི་འབྱུང་སྟེ།
en: As there is no fear, there is no instability.

source: །མི་གཡོ་བ་ལ་སྐྲག་པ་ག་ལ་ཡོད།
en: How can those who are unshakable feel fear?

source: །དེ་ནི་བདུད་རྣམས་བྱེ་བས་བསྐྱོད་མི་ནུས།
en: Even millions of māras cannot disturb them. {29}

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་པའི་ཕྱིར།
en: “ ‘The one who benefits bodhisattvas

source: །སྡོམ་པ་གང་སྤྱོད་བཤད་ཅིང་རབ་བསྟན་པ།
en: Explains and teaches the practice of restraint. Even millions of māras cannot disturb

source: །འདི་འདྲའི་ལུས་ཀྱི་སྡོམ་པ་སུས་བསླབས་པ། །དེ་ནི་བདུད་རྣམས་བྱེ་བས་བསྐྱོད་མི་ནུས།
en: The one who has trained in this restraint of the body. {30}

source: །ཆོས་རྣམས་ཀུན་ལ་ཡེ་ཤེས་ཐོགས་པ་མེད།
en: “ ‘Unimpeded knowledge of the entire Dharma,

source: །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་ཚང་།
en: The complete eighty secondary signs,

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་གྱི་རི་མོ་དག །སྡོམ་པར་གནས་ལ་རྙེད་པར་དཀའ་མི་འགྱུར།
en: And the thirty-two primary signs of a pure mind Are not difficult to obtain for one established in restraint. {31}

source: །སངས་རྒྱས་ཆོས་རྣམས་བསམ་གྱིས་མི་ཁྱབ་ཅིང་། །ཚད་ཀྱང་མེད་པར་རྟོགས་པར་སུ་འདོད་པ།
en: “ ‘Whoever wishes to realize the qualities of a buddha, Which are inconceivable and beyond measure,

source: །འདི་འདྲའི་ལུས་ཀྱི་སྡོམ་པ་དེས་སློབས་ཤིག །
en: Should train in this kind of restraint of the body

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ཡང་མཆོད་རྟེན་འགྱུར།
en: And become a shrine for the entire world. {32} “ ‘Whoever wishes for these qualities of a great sage,

source: །སངས་རྒྱས་སྟོབས་བཅུ་མངའ་བ་བསམ་མི་ཁྱབ། །དྲང་སྲོང་ཆེན་པོའི་ཆོས་འདི་གང་འདོད་པ།
en: For the ten inconceivable strengths of a buddha,

source: །དེས་ནི་ལུས་ཀྱི་སྡོམ་པ་འདི་འདྲ་སློབས།
en: Should train in this restraint of the body.

source: །གང་སློབ་དེ་ལ་སྟོབས་རྣམས་རྙེད་མི་དཀའ། །འདི་འདྲའི་ལུས་ཀྱི་སྡོམ་ལ་གང་སློབ་པ།
en: The strengths are not difficult to attain for one thus trained. {33}

source: །སངས་རྒྱས་ཆོས་ནི་མ་འདྲེས་བཅྭ་བརྒྱད་པོ།
en: “ ‘The eighteen distinct qualities of a buddha,

source: །རྒྱལ་བ་གང་ལ་རབ་ཏུ་གནས་པ་ཡང་།
en: In which the jinas are established,

source: །དེ་དག་དེ་ལ་རྙེད་པར་དཀའ་མི་འགྱུར།
en: Are not difficult to attain for someone

source: །འདི་འདྲའི་ལུས་ཀྱི་སྡོམ་པ་གང་སློབ་པ།
en: Who has trained in this restraint of the body. {34}

source: །དྲང་སྲོང་ཆེན་པོའི་བྱང་ཆུབ་ཡན་ལག་བདུན།
en: “ ‘The seven limbs of enlightenment of the great sages,

source: །སོ་སོ་ཡང་དག་རིག་དང་རྫུ་འཕྲུལ་རྐང་།
en: And their discernments and bases of miraculous powers,

source: །དེ་ལ་དེ་དག་རྙེད་པར་དཀའ་མི་འགྱུར།
en: Are not difficult to attain for someone Who has trained in this restraint of the body. {35}

source: །ཚངས་པའི་གནས་བཞི་དང་ནི་བསམ་གཏན་དང་། །རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་གང་བཤད་དང་། །བདེ་བའི་རྣམ་རྟོག་རབ་ཏུ་དབེན་པ་ཡང་།
en: “ ‘The four brahmavihāras and the dhyānas, The doorways to liberation that have been taught, And easeful examination and analysis

source: །སྡོམ་པར་གནས་པ་ལ་ནི་རྙེད་མི་དཀའ།
en: Are not difficult to attain for one established in restraint. {36}

source: །ལུས་ཀྱི་སྡོམ་པ་ལ་ནི་གང་གནས་པ།
en: “ ‘One who is established in this supreme restraint

source: །སྙིང་རྗེའི་གནས་དང་བཏང་སྙོམས་ཐོབ་པར་འགྱུར།
en: Dwells in compassion and also in equanimity,

source: །དེ་བཞིན་སྤྱོད་པ་འཇུག་པ་བྱམས་པའི་མཆོག །འགྲོ་བ་ཀུན་ལའང་ཕན་པའི་སེམས་སུ་འགྱུར།
en: And likewise practices the conduct of supreme love, And has the motivation to benefit all beings. {37}

source: །དྲན་པ་ཉེར་གཞག་ཡང་དག་སྤོང་བ་དང་། །དྲང་སྲོང་ཆེན་པོའི་དབང་ལྔ་སྟོབས་ལྔ་དང་། །འཕགས་པའི་ལམ་མཆོག་ཡན་ལག་བརྒྱད་པོ་ཡང་།
en: “ ‘Maintaining mindfulness and correct exertion, The five strengths and five powers of the great sages, And the eight branches of the supreme path of the noble ones

source: །ལུས་ཀྱི་སྡོམ་པར་གནས་ལ་རྙེད་མི་དཀའ།
en: Are not difficult to attain for one trained in restraint of the body. {38}

source: །གཞན་ཡང་དམ་པ་སངས་རྒྱས་ཆོས་རྣམས་ནི།
en: “ ‘Also, the other sublime qualities of a buddha,

source: །བསམ་གྱིས་མི་ཁྱབ་གང་ལ་ཚད་མེད་པ།
en: Which are inconceivable and beyond measure, Are all not difficult to attain for someone

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་འདྲ་སུས་བསླབས་པ། །དེ་ལ་ཐམས་ཅད་རྙེད་པར་དཀའ་མི་འགྱུར།
en: Who has trained in this restraint of the body.’ {39}

source: །འདི་འདྲའི་ལུས་ཀྱི་སྡོམ་པ་ཐོས་ནས་ནི།
en: “When he had listened to this restraint of the body,

source: །རྒྱལ་པོ་གླང་མཆོག་ཁྱད་པར་ཐོབ་གྱུར་ཏེ།
en: The eminent king gained exceptional accomplishment.

source: །དགའ་བ་མཚུངས་མེད་རངས་ཤིང་མགུ་བ་སྐྱེས།
en: He felt the highest joy and unequaled happiness

source: །རབ་ཏུ་དེ་བྱུང་ལོ་ཡང་བྱེ་ཕྲག་བཅུར།
en: “For a hundred million years he entered homelessness

source: །ཚངས་པར་སྤྱོད་མཆོག་གཙང་མ་སྤྱད་པར་གྱུར།
en: And practiced a pure and perfect celibacy. He also meditated on the four brahmavihāras

source: །ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ཕན་པའི་ཕྱིར། །ཚངས་པའི་གནས་བཞི་ལ་ཡང་བསྒོམ་པ་བྱས།
en: In order to benefit the world and its devas. {41}

source: །ཚངས་པའི་གནས་ལ་ཤིན་ཏུ་བསྒོམ་བྱས་པས།
en: “Having meditated well on the brahmavihāras,

source: །སངས་རྒྱས་བྱེ་བ་བརྒྱད་ཅུ་མཐོང་བར་གྱུར།
en: He saw eight hundred million buddhas,

source: །དེ་ལས་ལྷག་པར་གང་གཱའི་བྱེ་མ་སྙེད།
en: And even more, as numerous as the Ganges sands,

source: །དེས་ནི་ཚངས་སྤྱོད་མཆོག་འདི་རབ་ཏུ་སྤྱད།
en: And he practiced this supreme celibacy. {42}

source: །ཐམས་ཅད་ཀྱི་ཡང་བསྟན་པར་རབ་བྱུང་སྟེ།
en: “He entered homelessness in all of their teachings

source: །ཚངས་པར་སྤྱོད་པ་བཟང་ཞིང་དག་པར་སྤྱད།
en: And practiced a pure and perfect celibacy. He became an excellent bhikṣu dharmabhāṇaka

source: །མང་དུ་ཐོས་ཤིང་སྤོབས་པར་ལྡན་པ་ཡི། །དགེ་སློང་ཆོས་སྨྲ་བ་ཡང་མཆོག་ཏུ་གྱུར།
en: Who was very learned and had eloquent speech. {43}

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་ནི་རབ་ཤེས་ན།
en: “Knowing well this restraint of the body,

source: །ཚུལ་ཁྲིམས་མ་དྲལ་ཚུལ་ཁྲིམས་སྐྱོན་མེད་འགྱུར།
en: He had unimpaired conduct, faultless conduct,

source: །ཚུལ་ཁྲིམས་རྣམ་དག་ཚུལ་ཁྲིམས་འདྲེས་པ་མེད།
en: Pure conduct, and unalloyed conduct,

source: །འཕགས་པའི་ཚུལ་ཁྲིམས་ཟག་པ་མེད་ལ་གནས།
en: And maintained noble conduct that was immaculate. {44}

source: །དེ་ཚེ་རྒྱལ་པོ་གླང་མཆོག་ཁྱད་པར་སེམས། །གཞོན་ནུ་གཞན་ཞིག་ཡིན་པར་སེམས་གྱུར་ན།
en: “If you think, young man, that Viśeṣacintin, The eminent king of that time, was someone else,

source: །དེ་ནི་གཞན་ཞིག་ཡིན་པར་མི་བལྟ་སྟེ།
en: Do not see him as being anyone else:

source: །ང་ནི་སྤྱད་པ་སྤྱོད་ཚེ་དེར་གྱུར་ཏོ།
en: That was me while I was practicing bodhisattva conduct. {45}

source: །དེ་ཕྱིར་གཞོན་ནུ་ང་ཡི་རྗེས་སློབས་ལ།
en: “Therefore, young man, follow my teaching,

source: །ལུས་ཀྱི་སྡོམ་པ་འདི་ལ་གནས་པར་གྱིས།
en: And maintain this restraint of the body.

source: །སྲོག་ཆགས་བྱེ་བ་གཞན་ལའང་རབ་སྟོན་དང་། །རིང་པོར་མི་ཐོགས་ཇི་བཞིན་ང་འདྲར་འགྱུར།
en: Teach it, too, to millions of other beings, And before long you will become the same as me.” {46}

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱའོ་ཞེས་གཞོན་ནུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བསླབ་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Then the Bhagavān said to Candraprabha, “Young man, you should train by thinking, ‘I will practice completely pure physical conduct in that way.’ Why is that?

source: གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་དམྱལ་བ་དག་ལ་མི་འཇིགས། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ངན་སོང་དག་གིས་འཇིགས་པར་མི་འགྱུར་རོ།
en: Because, young man, the bodhisattva mahāsattvas who have completely pure physical conduct have no fear of the hells, of rebirth as an animal, of the realm of Yama, or of any other lower existences.

source: །ཆུས་མི་འཇིགས། མེས་མི་འཇིགས། དུག་དང་། མཚོན་དང་། སེང་གེ་དང་། སྟག་དང་དྲེད་དང་བལ་གླང་དང་གླང་ཁྱུ་བ་དང་། མི་དང་མི་མ་ཡིན་པ་དག་གིས་འཇིགས་པར་མི་འགྱུར་རོ།
en: They have no fear of water, and no fear of fire, of poison, of weapons, of lions, of tigers, of bears, of elephants, of bulls, or of humans and nonhumans.

source: །གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལག་མཐིལ་དུ་བཞག་སྟེ། ཏ་ལ་གཅིག་ཙམའམ། ཏ་ལ་གཉིས་ཙམའམ། ཏ་ལ་གསུམ་ཙམའམ། ཏ་ལ་བཞི་ཙམའམ། ཏ་ལ་ལྔ་ཙམའམ།
en: “Young man, bodhisattva mahāsattvas who have completely pure physical conduct can place the great billion-world universe on the palm of their hand and throw it up to the height of one palm tree, two palm trees, three palm trees, four palm trees, five palm trees, six palm trees, seven palm trees, or as high as they wish to throw it.
